## Series

### Creation of series

In [5]:
import pandas as pd

In [7]:
# Creation of Series from Scalar Values
series1 = pd.Series([10,20,30]) 
print(series1)
print(type(series1))

0    10
1    20
2    30
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
series1 = pd.Series(["10","20","30"]) 
series1

0    10
1    20
2    30
dtype: object

In [13]:
# Creation of Series from NumPy Arrays
import numpy as np
array1 = np.array([10, 20, 30])
print(type(array1))
series1 = pd.Series(array1)
series1

<class 'numpy.ndarray'>

0    10
1    20
2    30
dtype: int32

In [15]:
series1 = pd.Series(["India", "London", "Tokyo"], index=[10, 20, 30])
series1

10     India
20    London
30     Tokyo
dtype: object

In [18]:
series1[30]

'Tokyo'

In [19]:
series1 = pd.Series(["NewDelhi", "London", "Tokyo"], index=["India", "UK", "Japan"])
series1

India    NewDelhi
UK         London
Japan       Tokyo
dtype: object

In [14]:
# Creation of Series from Dictionary
dict1 = {'India': 'NewDelhi', 'UK': 'London', 'Japan': 'Tokyo'}
series1 = pd.Series(dict1)
series1

India    NewDelhi
UK         London
Japan       Tokyo
dtype: object

### Accessing Elements of a Series

In [ ]:
# Indexing

In [26]:
series1 = pd.Series(['NewDelhi', "Peris", "NY", "London"], index = ["India", "France", "USA", "UK"])
series1

India     NewDelhi
France       Peris
USA             NY
UK          London
dtype: object

In [27]:
series1[["India","France"]]

India     NewDelhi
France       Peris
dtype: object

In [28]:
series1[["India", "France"]]

India     NewDelhi
France       Peris
dtype: object

In [29]:
series1 = pd.Series(["India", "London", "Tokyo"], index=[10, 20, 30])
series1

10     India
20    London
30     Tokyo
dtype: object

In [30]:
series1.index = [100, 200, 300]
series1

100     India
200    London
300     Tokyo
dtype: object

In [ ]:
# Slicing

In [31]:
series2 = pd.Series(['NewDelhi', "Peris", "NY", "London"], index = ["India", "France", "USA", "UK"])
series2

India     NewDelhi
France       Peris
USA             NY
UK          London
dtype: object

In [32]:
series2[1:3] ## start to end - 1

France    Peris
USA          NY
dtype: object

In [33]:
series2["France":"UK"] ## for labeled indices last value is included

France     Peris
USA           NY
UK        London
dtype: object

In [34]:
series2[::-1]

UK          London
USA             NY
France       Peris
India     NewDelhi
dtype: object

In [36]:
series2[1:3] = "New Capital"
series2

India        NewDelhi
France    New Capital
USA       New Capital
UK             London
dtype: object

### Attributes of Series

In [37]:
series3 = pd.Series(['NewDelhi', "Peris", "NY", "London"], index = ["India", "France", "USA", "UK"])
series3

India     NewDelhi
France       Peris
USA             NY
UK          London
dtype: object

In [40]:
series3.name = "My series"
series3

India     NewDelhi
France       Peris
USA             NY
UK          London
Name: My series, dtype: object

In [43]:
series3.index.name = "Index"
series3

Index
India     NewDelhi
France       Peris
USA             NY
UK          London
Name: My series, dtype: object

In [44]:
## all values
series3.values

array(['NewDelhi', 'Peris', 'NY', 'London'], dtype=object)

In [45]:
## no of elements
series3.size

4

In [47]:
series3.empty

False

### Methods of Series

In [50]:
## top n elements, n=5, by default
series4 = pd.Series(['NewDelhi', "Peris", "NY", "London", "Tyoko", "Beging"], 
                    index = ["India", "France", "USA", "UK", "Japan", "China"])
series4.head(6)

India     NewDelhi
France       Peris
USA             NY
UK          London
Japan        Tyoko
China       Beging
dtype: object

In [52]:
series4.tail(3)

UK       London
Japan     Tyoko
China    Beging
dtype: object

In [64]:
## top n elements, n=5, by default
series5 = pd.Series(['NewDelhi', "Peris", "NY", "London", "nan", "Beging"], 
                    index = ["India", "France", "USA", "UK", "Japan", "China"])
series5.head(6)

India     NewDelhi
France       Peris
USA             NY
UK          London
Japan          nan
China       Beging
dtype: object

In [63]:
series5.count() ## not nan values

6

### Mathematical Operations on Series

In [72]:
seriesA = pd.Series([1,2,3,4,5], index = ['a', 'b', 'c', 'd', 'e'])

seriesB = pd.Series([10,20,-10,-50,100], index = ['z', 'y', 'a', 'c', 'e'])

# seriesA = pd.Series([1,2,3,4,5, 10])
# seriesB = pd.Series([10,20,-10,-50,100])

In [74]:
## addition
seriesA + seriesB

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [75]:
seriesA.add(seriesB, fill_value = 5) ## nan values

a     -9.0
b      7.0
c    -47.0
d      9.0
e    105.0
y     25.0
z     15.0
dtype: float64

In [ ]:
## Subtraction of two Series

In [76]:
seriesA = pd.Series([1,2,3,4,5], index = ['a', 'b', 'c', 'd', 'e'])
seriesB = pd.Series([10,20,-10,-50,100], index = ['z', 'y', 'a', 'c', 'e'])

In [78]:
seriesA - seriesB

a    11.0
b     NaN
c    53.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [79]:
seriesA.sub(seriesB, fill_value = 5) ## nan values

a    11.0
b    -3.0
c    53.0
d    -1.0
e   -95.0
y   -15.0
z    -5.0
dtype: float64

In [ ]:
# Multiplication of two Series

In [80]:
seriesA * seriesB

a    -10.0
b      NaN
c   -150.0
d      NaN
e    500.0
y      NaN
z      NaN
dtype: float64

In [81]:
seriesA.mul(seriesB, fill_value = 1) ## nan values

a    -10.0
b      2.0
c   -150.0
d      4.0
e    500.0
y     20.0
z     10.0
dtype: float64

In [ ]:
#  Division of two Series

In [82]:
seriesA / seriesB

a   -0.10
b     NaN
c   -0.06
d     NaN
e    0.05
y     NaN
z     NaN
dtype: float64

In [83]:
seriesA.divide(seriesB, fill_value = 1) ## nan values

a   -0.10
b    2.00
c   -0.06
d    4.00
e    0.05
y    0.05
z    0.10
dtype: float64

### DataFrame

In [ ]:
## Example

In [84]:
ResultSheet={
'Arnab': pd.Series([90, 91, 97],
 index=['Maths','Science','Hindi']),
'Ramit': pd.Series([92, 81, 96],
 index=['Maths','Science','Hindi']),
'Samridhi': pd.Series([89, 91, 88],
 index=['Maths','Science','Hindi']),
'Riya': pd.Series([81, 71, 67],
 index=['Maths','Science','Hindi']),
'Mallika': pd.Series([94, 95, 99],
 index=['Maths','Science','Hindi'])}

In [85]:
df = pd.DataFrame(ResultSheet)
df

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

#### Creation of an empty DataFrame

In [90]:
import pandas as pd
dFrameEmt = pd.DataFrame()
print(dFrameEmt)
type(dFrameEmt)

Empty DataFrame
Columns: []
Index: []

pandas.core.frame.DataFrame

#### Creation of DataFrame from NumPy ndarrays

In [96]:

import numpy as np
array1 = np.array([10,20, 30])
array2 = np.array([100,200, 300])
array3 = np.array([-10,-20,-30, -40])

# dFrame4 = pd.DataFrame(array1)
# print(dFrame4)
# dFrame4

dFrame5 = pd.DataFrame([array1, array3, array2], columns=[ 'A', 'B', 'C', 'D'])
print(dFrame5)

     A    B    C     D
0   10   20   30   NaN
1  -10  -20  -30 -40.0
2  100  200  300   NaN

#### Creation of DataFrame from List of Dictionaries

In [97]:

listDict = [{'a':10, 'b':20}, {'a':5, 'b':10, 'c':20}]

dFrameListDict = pd.DataFrame(listDict)
print(dFrameListDict)

    a   b     c
0  10  20   NaN
1   5  10  20.0

#### Creation of DataFrame from Dictionary of Lists

In [105]:

dictForest = {'State': ['Assam', 'Delhi', 'Kerala'],
             'GArea': [78438, 1483, 38852] ,
             'VDF' : [2797, 6.72,1663]}

# dFrameForest= pd.DataFrame(dictForest)

dFrameForest = pd.DataFrame(dictForest, columns = ["State", "VDF", "GArea"])
print(dFrameForest)

    State      VDF  GArea
0   Assam  2797.00  78438
1   Delhi     6.72   1483
2  Kerala  1663.00  38852

#### Creation of DataFrame from Series

In [101]:

seriesA = pd.Series([1,2,3,4,5], index = ['a', 'b', 'c', 'd', 'e'])
seriesB = pd.Series ([1000,2000,-1000,-5000,1000], index = ['a', 'b', 'c', 'd', 'e'])
seriesC = pd.Series([10,20,-10,-50,100], index = ['z', 'y', 'a', 'c', 'e'])

dFrame6 = pd.DataFrame(seriesA)
# print(dFrame6)
dFrame7 = pd.DataFrame([seriesA, seriesC])
print(dFrame7)

      a    b     c    d      e     z     y
0   1.0  2.0   3.0  4.0    5.0   NaN   NaN
1 -10.0  NaN -50.0  NaN  100.0  10.0  20.0

#### Creation of DataFrame from Dictionary of Series

In [102]:

ResultSheet={
            'Arnab': pd.Series([90, 91, 97],
             index=['Maths','Science','Hindi']),
    
            'Ramit': pd.Series([92, 81, 96],
             index=['Maths','Science','Hindi']),
    
            'Samridhi': pd.Series([89, 91, 88],
             index=['Maths','Science','Hindi']),
    
            'Riya': pd.Series([81, 71, 67],
             index=['Maths','Science','Hindi']),
    
            'Mallika': pd.Series([94, 95, 99],
             index=['Maths','Science','Hindi'])
}

In [103]:
ResultDF = pd.DataFrame(ResultSheet)
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [ ]:
# Operations on rows and columns in DataFrames

In [114]:
ResultSheet={
            'Arnab': pd.Series([90, 91, 97],
             index=['Maths','Science','Hindi']),
    
            'Ramit': pd.Series([92, 81, 96],
             index=['Maths','Science','Hindi']),
    
            'Samridhi': pd.Series([89, 91, 88],
             index=['Maths','Science','Hindi']),
    
            'Riya': pd.Series([81, 71, 67],
             index=['Maths','Science','Hindi']),
    
            'Mallika': pd.Series([94, 95, 99],
             index=['Maths','Science','Hindi'])
}
ResultDF = pd.DataFrame(ResultSheet)
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [108]:
## Adding a new column 
ResultDF['Preeti'] = [89,78,76]
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      89
Science     91     81        91    71       95      78
Hindi       97     96        88    67       99      76

In [110]:
# Adding a New Row to a DataFrame 
ResultDF.loc['English'] = [85, 86, 83, 80, 90, 89]
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      89
Science     91     81        91    71       95      78
Hindi       97     96        88    67       99      76
English     85     86        83    80       90      89

In [111]:
## update
ResultDF.loc['English'] = [95, 86, 95, 80, 95,99]
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      89
Science     91     81        91    71       95      78
Hindi       97     96        88    67       99      76
English     95     86        95    80       95      99

In [115]:
## set value
ResultDF.loc['English'] = 99
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99
English     99     99        99    99       99

In [113]:
## set all value
ResultDF[:] = 0
print(ResultDF)

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths        0      0         0     0        0       0
Science      0      0         0     0        0       0
Hindi        0      0         0     0        0       0
English      0      0         0     0        0       0

In [116]:
ResultSheet={
            'Arnab': pd.Series([90, 91, 97],
             index=['Maths','Science','Hindi']),
    
            'Ramit': pd.Series([92, 81, 96],
             index=['Maths','Science','Hindi']),
    
            'Samridhi': pd.Series([89, 91, 88],
             index=['Maths','Science','Hindi']),
    
            'Riya': pd.Series([81, 71, 67],
             index=['Maths','Science','Hindi']),
    
            'Mallika': pd.Series([94, 95, 99],
             index=['Maths','Science','Hindi'])
}
ResultDF = pd.DataFrame(ResultSheet)
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [117]:
# Deleting Rows or Columns from a DataFrame, 
## row ->> axis = 0
ResultDF = ResultDF.drop('Science', axis=0)
ResultDF

       Arnab  Ramit  Samridhi  Riya  Mallika
Maths     90     92        89    81       94
Hindi     97     96        88    67       99

In [118]:
## column -->> axis = 1
ResultDF = ResultDF.drop(['Samridhi','Ramit','Riya'], axis=1)
ResultDF

       Arnab  Mallika
Maths     90       94
Hindi     97       99

In [121]:
ResultSheet={
            'Arnab': pd.Series([90, 91, 97],
             index=['Maths','Science','Hindi']),
    
            'Ramit': pd.Series([92, 81, 96],
             index=['Maths','Science','Hindi']),
    
            'Samridhi': pd.Series([89, 91, 88],
             index=['Maths','Science','Hindi']),
    
            'Riya': pd.Series([81, 71, 67],
             index=['Maths','Science','Hindi']),
    
            'Mallika': pd.Series([94, 95, 99],
             index=['Maths','Science','Hindi'])
}
ResultDF = pd.DataFrame(ResultSheet)
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [122]:
# Renaming Row Labels of a DataFrame
ResultDF=ResultDF.rename({'Maths':'Sub1', 'Science':'Sub2','English':'Sub3'}, axis='index')
ResultDF

       Arnab  Ramit  Samridhi  Riya  Mallika
Sub1      90     92        89    81       94
Sub2      91     81        91    71       95
Hindi     97     96        88    67       99

In [123]:
## if not specified, left as it is
ResultDF=ResultDF.rename({'Maths':'Sub1','Science':'Sub2','Hindi':'Sub4'}, axis='index')
ResultDF

      Arnab  Ramit  Samridhi  Riya  Mallika
Sub1     90     92        89    81       94
Sub2     91     81        91    71       95
Sub4     97     96        88    67       99

In [124]:
#  Renaming Column Labels of a DataFrame : 
ResultDF=ResultDF.rename({'Arnab':'Student1','Ramit':'Student2',' Samridhi':'Student3','Mallika':'Student4'},axis='columns')
ResultDF

      Student1  Student2  Samridhi  Riya  Student4
Sub1        90        92        89    81        94
Sub2        91        81        91    71        95
Sub4        97        96        88    67        99

### Accessing DataFrames Element through Indexing :

In [125]:
ResultSheet={
            'Arnab': pd.Series([90, 91, 97],
             index=['Maths','Science','Hindi']),
    
            'Ramit': pd.Series([92, 81, 96],
             index=['Maths','Science','Hindi']),
    
            'Samridhi': pd.Series([89, 91, 88],
             index=['Maths','Science','Hindi']),
    
            'Riya': pd.Series([81, 71, 67],
             index=['Maths','Science','Hindi']),
    
            'Mallika': pd.Series([94, 95, 99],
             index=['Maths','Science','Hindi'])
}
ResultDF = pd.DataFrame(ResultSheet)
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [129]:
# Label Based Indexing : 
ResultDF.loc['Science']
# print(type(ResultDF.loc['Science']))

Arnab       91
Ramit       81
Samridhi    91
Riya        71
Mallika     95
Name: Science, dtype: int64

In [130]:
# column as a Series
ResultDF.loc[:,'Arnab']

Maths      90
Science    91
Hindi      97
Name: Arnab, dtype: int64

In [131]:
print(type(ResultDF.loc[:,'Arnab']))

<class 'pandas.core.series.Series'>

In [132]:
ResultDF.loc[['Science', 'Hindi']]

         Arnab  Ramit  Samridhi  Riya  Mallika
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [133]:
## column
ResultDF[['Arnab','Ramit', 'Samridhi']]

         Arnab  Ramit  Samridhi
Maths       90     92        89
Science     91     81        91
Hindi       97     96        88

In [134]:
## Boolean Indexing
ResultDF.loc['Maths'] > 90

Arnab       False
Ramit        True
Samridhi    False
Riya        False
Mallika      True
Name: Maths, dtype: bool

### Accessing DataFrames Element through Slicing

In [136]:
## slicing
ResultDF.loc['Maths': 'Hindi']

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [137]:
## from rows math and science for column "Arnab"
ResultDF.loc['Maths': 'Science', 'Arnab']

Maths      90
Science    91
Name: Arnab, dtype: int64

In [138]:
 ResultDF.loc['Maths': 'Science', 'Arnab':'Samridhi']

         Arnab  Ramit  Samridhi
Maths       90     92        89
Science     91     81        91

In [140]:
ResultDF.loc['Maths': 'Science', ['Arnab','Samridhi', 'Riya']]

         Arnab  Samridhi  Riya
Maths       90        89    81
Science     91        91    71

### Filtering Rows in DataFrames :

In [141]:
ResultDF.loc[[True, False, True]]

       Arnab  Ramit  Samridhi  Riya  Mallika
Maths     90     92        89    81       94
Hindi     97     96        88    67       99

In [146]:
ResultDF[[True, False, False]]

       Arnab  Ramit  Samridhi  Riya  Mallika
Maths     90     92        89    81       94

### Joining, Merging and Concatenation of DataFrames

In [ ]:
# Joining

In [150]:
dFrame1=pd.DataFrame([[1, 2, 3], [4, 5], [6]], columns=['C1', 'C2', 'C3'], index=['R1', 
'R2', 'R3'])

In [151]:
dFrame2=pd.DataFrame([[10, 20], [30], [40, 50]], columns=['C2', 'C5'], index=['R4', 'R2', 
'R5'])

In [154]:
dFrame1

    C1   C2   C3
R1   1  2.0  3.0
R2   4  5.0  NaN
R3   6  NaN  NaN

In [155]:
dFrame2

    C2    C5
R4  10  20.0
R2  30   NaN
R5  40  50.0

In [187]:
NewDf = pd.concat([dFrame1, dFrame2])
NewDf

     C1    C2   C3    C5
R1  1.0   2.0  3.0   NaN
R2  4.0   5.0  NaN   NaN
R3  6.0   NaN  NaN   NaN
R4  NaN  10.0  NaN  20.0
R2  NaN  30.0  NaN   NaN
R5  NaN  40.0  NaN  50.0

In [178]:
# Creating the first Dataframe using dictionary
df1 = df = pd.DataFrame({"a":[1, 2, 3, 4],
                         "b":[5, 6, 7, 8]})
  
# Creating the Second Dataframe using dictionary
df2 = pd.DataFrame({"a":[1, 2, 3],
                    "b":[5, 6, 7]})

In [180]:
# https://stackoverflow.com/questions/75956209/dataframe-object-has-no-attribute-append
# https://www.geeksforgeeks.org/python-pandas-dataframe-append/

In [183]:
NewDf = pd.concat([df1, df2])
NewDf

   a  b
0  1  5
1  2  6
2  3  7
3  4  8
0  1  5
1  2  6
2  3  7

In [184]:
# dFrame1.append(dFrame2)
NewDf = pd.concat([dFrame1, dFrame2])
NewDf

     C1    C2   C3    C5
R1  1.0   2.0  3.0   NaN
R2  4.0   5.0  NaN   NaN
R3  6.0   NaN  NaN   NaN
R4  NaN  10.0  NaN  20.0
R2  NaN  30.0  NaN   NaN
R5  NaN  40.0  NaN  50.0

### Attributes of DataFrames :

In [161]:
ForestArea = {
 'Assam' :pd.Series([78438, 2797, 
10192, 15116], index = ['GeoArea', 'VeryDense', 
'ModeratelyDense', 'OpenForest']),
 'Kerala' :pd.Series([ 38852, 1663, 
9407, 9251], index = ['GeoArea' ,'VeryDense', 
'ModeratelyDense', 'OpenForest']),
 'Delhi' :pd.Series([1483, 6.72, 56.24, 
129.45], index = ['GeoArea', 'VeryDense', 
'ModeratelyDense', 'OpenForest'])}

ForestAreaDF = pd.DataFrame(ForestArea)
ForestAreaDF

                 Assam  Kerala    Delhi
GeoArea          78438   38852  1483.00
VeryDense         2797    1663     6.72
ModeratelyDense  10192    9407    56.24
OpenForest       15116    9251   129.45

In [160]:
# to display row labels
ForestAreaDF.index

Index(['GeoArea', 'VeryDense', 'ModeratelyDense', 'OpenForest'], dtype='object')

In [162]:
# to display row labels
ForestAreaDF.columns

Index(['Assam', 'Kerala', 'Delhi'], dtype='object')

In [163]:
# to display data type of each column in the DataFrame
ForestAreaDF.dtypes

Assam       int64
Kerala      int64
Delhi     float64
dtype: object

In [165]:
# to display a NumPy ndarray having all the values in the DataFrame, without the axes labels
ForestAreaDF.values 
type(ForestAreaDF.values)

numpy.ndarray

In [166]:
# to display  dimensionality of the DataFrame
ForestAreaDF.shape

(4, 3)

In [167]:
ForestAreaDF.size

12

In [168]:
## trnspose
ForestAreaDF.T

        GeoArea  VeryDense  ModeratelyDense  OpenForest
Assam   78438.0    2797.00         10192.00    15116.00
Kerala  38852.0    1663.00          9407.00     9251.00
Delhi    1483.0       6.72            56.24      129.45

In [170]:
## last n rows
ForestAreaDF.tail(5)

                 Assam  Kerala    Delhi
GeoArea          78438   38852  1483.00
VeryDense         2797    1663     6.72
ModeratelyDense  10192    9407    56.24
OpenForest       15116    9251   129.45

In [173]:
## first n rows
ForestAreaDF.head(2)

           Assam  Kerala    Delhi
GeoArea    78438   38852  1483.00
VeryDense   2797    1663     6.72

In [174]:
ForestAreaDF.empty

False

### Importing and Exporting Data between CSV Files and DataFrames

In [ ]:
# Importing and Exporting Data between CSV nFiles and DataFrames

In [175]:
marks = pd.read_csv(r"C:\Users\atalb\Documents\Python training notebooks\ResultData.csv",sep =",", header=0)
marks

   RollNo     Name  Eco  Maths
0       1    Arnab   18     57
1       2  Kritika   23     45
2       3   Divyam   51     37
3       4   Vivaan   40     60
4       5  Aaroosh   18     27

In [177]:
marks.to_csv(path_or_buf=r"C:\Users\atalb\Documents\Python training notebooks\ResultData_output22.csv", sep=',', index = False)

### Problem 1

Create the following Series and do the specified operations:
    
a) EngAlph, having 26 elements with the alphabets as values and default index values. 

b) Vowels, having 5 elements with index labels a, e, i, o and u and all the five values set to zero. 
Check if it is an empty series. 

c) Friends, from a dictionary having roll numbers of five of your friends as data and their first name as keys.

d) MTseries, an empty Series. Check if it is an empty series.

e) MonthDays, from a numpy array having the number of days in the 12 months of a year. The labels should be the 
month numbers from 1 to 12.

### Problem 2

Create the following DataFrame Sales containing year wise sales figures for five sales persons in INR. Use the years 
as column labels, and sales person names as row labels


        2014 2015 2016 2017
        
Madhu 100.5 12000 20000 50000

Kusum 150.8 18000 50000 60000

Kinshuk 200.9 22000 70000 70000

Ankit 30000 30000 100000 80000

Shruti 40000 45000 125000 90000

### Problem 3

Use the DataFrame created in Problem 2 above to do the following: 
    
a) Display the row labels of Sales.

b) Display the column labels of Sales.

c) Display the data types of each column of Sales.

d) Display the dimensions, shape, size and values of Sales.

e) Display the last two rows of Sales.

f) Display the first two columns of Sales.